<template>
  <AppHeader />
  <div class="about">
    <div class="about-content">
      <h1>Про нас</h1>
      <div>
        <p>
          Ми - маленька транспортна компанія, яка працює з вантажними
          перевезеннями та встановленням меблів, пральних машин та іншої
          техніки. Наша команда складається з декількох досвідчених та
          професійних спеціалістів, які присвятили себе наданню високоякісних
          послуг нашим клієнтам.
        </p>
      </div>
    </div>
    <div class="about-content">
      <div>
        <h2>Перевезення вантажів</h2>
        <p>
          Наші перевезення забезпечують безпечну та надійну доставку вантажів
          уздовж маршрутів, що охоплюють широку територію. Ми розуміємо, що
          вантажі мають бути доставлені вчасно та без пошкоджень, тому ми
          приділяємо особливу увагу деталям та застосовуємо передові методи
          перевезення та пакування.
        </p>
      </div>
    </div>

    <div>
      <h2>Встановлення меблів та техніки</h2>
      <p>
        Крім перевезень, ми також надаємо послуги з встановлення меблів,
        пральних машин та іншої техніки. Наші кваліфіковані майстри забезпечують
        професійний та точний монтаж, гарантуючи високу якість роботи.
      </p>
    </div>

    <div>
      <h2>Наш підхід до роботи</h2>
      <p>
        Наш підхід до роботи базується на індивідуальному підході до кожного
        клієнта. Ми розуміємо, що кожне завдання унікальне, тому ми працюємо в
        тісному співробітництві з клієнтами, щоб задовольнити їхні потреби та
        виконати їх очікування. Наша команда завжди старається забезпечити
        високий рівень задоволення клієнтів та надати їм позитивний досвід
        співпраці з нами.
      </p>
    </div>

    <div>
      <h2>Звертайтеся до нас</h2>
      <p>
        Якщо вам потрібна допомога з перевезенням вантажів або встановленням
        меблів та техніки, звертайтеся до нас. Ми готові забезпечити якісну та
        професійну допомогу, щоб зробити ваше життя зручнішим та легшим.
      </p>
    </div>

    <div>
      <h3>З повагою,</h3>
      <p>Команда нашої компанії</p>
    </div>
  </div>
  <AppFooter />
</template>

<script>
import AppHeader from "@/components/Header.vue";
import AppFooter from "@/components/Footer.vue";

export default {
  name: "ContactView",
  components: {
    AppHeader,
    AppFooter,
  },
};
</script>

<style scoped>
.about {
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  min-height: 100vh;
  padding: 0 5%;
}

.about-content {
  max-width: 90%;
  margin: 0 auto;
}

footer {
  bottom: 0;
  width: 100%;
  border-top: 1px solid #ddd;
}
</style>
